Repository: hypadilla/MeliChallenge
Catalog: MeliChallenge/App/Resources/Localized/Localizable.xcstrings
Source language: en
Languages: es_419

source: Data parsed successfully.
es_419: Datos parseados exitosamente.

source: Data parsing error: %@
es_419: Error al parsear datos: %@

source: Failed to fetch data: %@
es_419: Error al obtener datos: %@

source: information
es_419: información

# invalid_response
source: Invalid response from server
es_419: Respuesta inválida del servidor

# invalid_url_error
source: The provided URL is invalid.
es_419: La URL proporcionada no es válida

# making_request
source: Making request to URL: %@
es_419: Realizando solicitud a la URL: %@

source: Network error: %@
es_419: Error de red: %@

source: No data received
es_419: No se recibieron datos

# no_defined_assets
source: is not defined in the Assets.
es_419: no está definido en los Assets.

# no_results
source: No results found
es_419: No se encontraron resultados

# received_data
source: Received data: %d bytes
es_419: Datos recibidos: %d bytes

# response_error
source: Response error with status code: %d"
es_419: Error en la respuesta con código de estado: %d

# retrying_request
source: Retrying request... (%d retries left)
es_419: Reintentando solicitud... (quedan %d intentos)

# search_bar_empty
source: Search bar is empty
es_419: La barra de búsqueda está vacía

source: Search on Mercado Libre
es_419: Buscar en Mercado Libre

source: Success
es_419: Éxito

source: User searched for:
es_419: El usuario buscó:
